//  დავალება 1
//   შექმენით მასივი ნებისმიერი ტიპის და რაოდენობის ელემენტებით.
//   ეკრანზე გამოიტანეთ ამ მასივის სიგრძე.

//  let arr = ["giorgi", "nika", "luka"];
//  document.write("ტექსტის სიგრძე: " + arr.length);

//  დავალება 2
//  მოცემულია მასივი arr.
//  ინდექსის გამოყენებით მასივს დაამატეთ ახალი ელემენტი 'd', ხოლო რიგით მეორე ელემენტი ჩაანაცვლეთ 'x'-ით.

// let arr = ["a", "b", "c"];
// arr.push("d");
// arr.splice(1, 1, "x");

// console.log(arr);

// დავალება 3
// მოცემულია ცარიელი მასივი arr.
// მეთოდი .push-ის გამოყენებით მასივს დაამატეთ ახალი ელემენტები 'a', 'b' და 'c'.

// let arr = [];
// arr.push("a", "b", "c");

// console.log(arr);

// დავალება 4
// მოცემულია კოდი, რომელმაც კონსოლზე უნდა გამოიტანოს მასივის ბოლო ელემნტი.
// აღმოაჩინეთ შეცდომა კოდში.
// let arr = [11, 22, 33, 44, 55];
// console.log(arr[arr.length]);

// let arr = [11, 22, 33, 44, 55];
// console.log(arr[arr.length - 1]);

// დავალება 5
// შექმენით მასივი [1, 2, 3, 4, 5] და გამოიყენეთ for ციკლი ყველა ელემენტის კონსოლში გამოსატანად.

// let arr = [1, 2, 3, 4, 5];
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }

// დავალება 6
// შექმენით მასივი [1, 2, 3, 4, 5] და გამოიყენეთ for ... of ციკლი ყველა ელემენტის კონსოლში გამოსატანად.

// let arr = [1, 2, 3, 4, 5];
// for (let i of arr) {
//     console.log(i);
// }

// დავალება 7
// შექმენით მასივი სიტყვებით(string) და დაბეჭდეთ მხოლოდ ის სიტყვები, რომელთა სიგრძე 4-ზე მეტია.

// let arr = ["გიორგი", "ნიკა", "ხე", "ჭა", "მანქანა", "ჭიშკარი"];
// for (let i = 0; i <arr.length; i++) {
//     if(arr[i].length > 4) {
//         console.log(arr[i]);
//     }
// }
